{
  "site": "https://crickettv.site",
  "updated_at": "2026-01-07T01:06:58.468444Z",
  "count": 4,
  "pages": [
    {
      "id": "captown-vs-joubarg",
      "title": "MI Cape Town vs Joburg Super Kings, 15th Match",
      "url": "https://crickettv.site/home/captown-vs-joubarg/",
      "description": "The SA20 2025-26 season moves forward, as MI Cape Town (MICT) are all set to host the Joburg Super Kings (JSK) in the Match No. 15 on Tuesday, January 6 at the Newlands in Cape Town. \n\nThe alarm bells are ringing, and MI Cape Town are on the brink of elimination already from the ongoing season. The franchise has failed to register a single win so far out of the five matches they have featured in. Their previous game saw them fail to post even 100 runs on the board, which was later chased down by the Paarl Royals with rather ease. They are in a dire need to pick up a win now.\n\n\nThe Joburg Super Kings, on the other hand, are the table toppers with an absolute domination on the points table. The Faf du Plessis-led side is yet to lose a single match this match, with 15 points to their tally after four matches. They already have a hat-trick of wins, but won't mind making it a double hat-trick and bolster their top spot on the table. High on confidence, the Super Kings will be eyeing to beat the hosts."
    },
    {
      "id": "england-vs-australia",
      "title": "CricTv - Australia Vs England, Day 4, Live Streaming",
      "url": "https://crickettv.site/home/england-vs-australia/",
      "description": "Ashes Day 4 Between England And Australia Catch Live Only On Cric Tv"
    },
    {
      "id": "indu19-vs-southafricau19",
      "title": "Cricket Tv - India u19 Vs South Africa U19 Live Streaming",
      "url": "https://crickettv.site/home/indu19-vs-southafricau19/",
      "description": "Catch Live India u19 Vs South Africa U19"
    },
    {
      "id": "perth-vs-melbourne",
      "title": "Perth Vs Melbourne Live Streaming - Key Details - Pitch Report - Winning Team",
      "url": "https://crickettv.site/home/perth-vs-melbourne/",
      "description": "The Perth Scorchers vs Melbourne Renegades match fits perfectly into a crucial phase of the tournament. The Scorchers have a good chance as they have gained some momentum in the previous games, and another victory will enhance their chances of making it to the playoffs.\n\nFor the , the stakes are even higher, as they are now in a must-win position after a run of close defeats pushed them towards the lower end of the table. To stay alive in the competition, they need consistency, calm decision-making, and the ability to"
    }
  ]
}