{
  "site": "https://crickettv.site",
  "updated_at": "2026-01-08T14:47:26.383409Z",
  "count": 7,
  "pages": [
    {
      "id": "indu19-vs-southafricau19",
      "title": "India U19 vs South Africa U19 Live Streaming",
      "url": "https://crickettv.site/home/indu19-vs-southafricau19/",
      "description": "India U19 take on South Africa U19 in an exciting youth international fixture."
    },
    {
      "id": "england-vs-australia",
      "title": "Australia vs England Live",
      "url": "https://crickettv.site/home/england-vs-australia/",
      "description": "Ashes Day 4 sees Australia in a dominant position after strong batting performances."
    },
    {
      "id": "perth-vs-melbourne",
      "title": "Perth vs Melbourne Live Streaming ",
      "url": "https://crickettv.site/home/perth-vs-melbourne/",
      "description": "The Perth Scorchers vs Melbourne Renegades match fits perfectly into a crucial phase of the tournament. The Scorchers have a good chance as they have gained some momentum in the previous games, and another victory will enhance their chances of making it to the playoffs.\n\nFor the , the stakes are even higher, as they are now in a must-win position after a run of close defeats pushed them towards the lower end of the table. To stay alive in the competition, they need consistency, calm decision-making, and the ability to"
    },
    {
      "id": "pakistan-vs-srilanka",
      "title": "Pakistan Vs Srilanka Live",
      "url": "https://crickettv.site/home/pakistan-vs-srilanka/",
      "description": "The much-anticipated T20I series between Sri Lanka and Pakistan kicks off today, at the Rangiri Dambulla International Stadium. Both teams are eager to fine-tune their squads ahead of the T20 World Cup in February, with this series offering crucial preparation for the global event."
    },
    {
      "id": "durban-vs-pretoria",
      "title": "Durban Vs Pretoria",
      "url": "https://crickettv.site/home/durban-vs-pretoria/",
      "description": "Durban Super Giants are set to lock horns with Pretoria Capitals in Match 16 of the SA20 2025-26 at Kingsmead in Durban, on Wednesday, January 07."
    },
    {
      "id": "star-vs-sixers",
      "title": "Melbourne Star Vs Sixers ",
      "url": "https://crickettv.site/home/star-vs-sixers/",
      "description": "Todays Big Bash League match between Melbourne Stars and Sydney Sixers is a crucial encounter as both teams fight to strengthen their position in the points table. Melbourne Stars will look to use home conditions and aggressive batting to dominate early, while Sydney Sixers rely on experience, composure, and a well-balanced squad. With quality players on both sides, this clash promises intense competition and high entertainment value for fans."
    },
    {
      "id": "joburag-vs-paarl",
      "title": "Joubarg Vs Paarl",
      "url": "https://crickettv.site/home/joburag-vs-paarl/",
      "description": "Durban Super Giants are set to lock horns with Pretoria Capitals in Match 16 of the SA20 2025-26 at Kingsmead in Durban, on Wednesday, January 07."
    }
  ]
}