{
  "site": "https://crickettv.site",
  "updated_at": "2026-01-11T09:49:15.614078Z",
  "count": 12,
  "pages": [
    {
      "id": "indu19-vs-southafricau19",
      "title": "India U19 vs South Africa U19 Live Streaming",
      "url": "https://crickettv.site/home/indu19-vs-southafricau19/",
      "description": "India U19 take on South Africa U19 in an exciting youth international fixture."
    },
    {
      "id": "england-vs-australia",
      "title": "Australia vs England Live",
      "url": "https://crickettv.site/home/england-vs-australia/",
      "description": "Ashes Day 4 sees Australia in a dominant position after strong batting performances."
    },
    {
      "id": "perth-vs-melbourne",
      "title": "Perth vs Melbourne Live Streaming ",
      "url": "https://crickettv.site/home/perth-vs-melbourne/",
      "description": "The Perth Scorchers vs Melbourne Renegades match fits perfectly into a crucial phase of the tournament. The Scorchers have a good chance as they have gained some momentum in the previous games, and another victory will enhance their chances of making it to the playoffs.\n\nFor the , the stakes are even higher, as they are now in a must-win position after a run of close defeats pushed them towards the lower end of the table. To stay alive in the competition, they need consistency, calm decision-making, and the ability to"
    },
    {
      "id": "pakistan-vs-srilanka",
      "title": "Pakistan Vs Srilanka Live",
      "url": "https://crickettv.site/home/pakistan-vs-srilanka/",
      "description": "The much-anticipated T20I series between Sri Lanka and Pakistan kicks off today, at the Rangiri Dambulla International Stadium. Both teams are eager to fine-tune their squads ahead of the T20 World Cup in February, with this series offering crucial preparation for the global event."
    },
    {
      "id": "durban-vs-pretoria",
      "title": "Durban Vs Pretoria",
      "url": "https://crickettv.site/home/durban-vs-pretoria/",
      "description": "Durban Super Giants are set to lock horns with Pretoria Capitals in Match 16 of the SA20 2025-26 at Kingsmead in Durban, on Wednesday, January 07."
    },
    {
      "id": "star-vs-sixers",
      "title": "Melbourne Star Vs Sixers ",
      "url": "https://crickettv.site/home/star-vs-sixers/",
      "description": "Todays Big Bash League match between Melbourne Stars and Sydney Sixers is a crucial encounter as both teams fight to strengthen their position in the points table. Melbourne Stars will look to use home conditions and aggressive batting to dominate early, while Sydney Sixers rely on experience, composure, and a well-balanced squad. With quality players on both sides, this clash promises intense competition and high entertainment value for fans."
    },
    {
      "id": "hobart-vs-adelaide",
      "title": "Hobart Hurricane Vs Adelaide Strikers ",
      "url": "https://crickettv.site/home/hobart-vs-adelaide/",
      "description": "In the 28th game of the BBL 2025-26, Hobart Hurricanes (HUR) are set to face Adelaide Strikers (STR). The Hobart Hurricanes are performing well in this season so far, as they won five out of the seven games. They also won the previous match against the Sydney Thunder by 6 wickets. Tim Ward performed well for them in the last game and scored 90 runs off 49 balls, while Will Prestwidge took two wickets in the bowling department. "
    },
    {
      "id": "rcb-vs-mi",
      "title": "RCB Vs MI - Live",
      "url": "https://crickettv.site/home/rcb-vs-mi/",
      "description": "All roads lead to Navi Mumbai as RCB gear up for the WPL 2026 season opener that kickstarts tomorrow. The fourth edition of the tournament will be bigger than anything you have ever seen and the Royal Challengers are all set to rumble.\n\nWith Smriti Mandhana returning to the helm of affairs, this will be her fourth season as the captain of RCB. However, this year, she will have a flurry of fresh faces alongside her to take the challenge head on. From Georgia Voll to Grace Harris, Linsey Smith to Radha Yadav, RCB did sign a handful of experienced campaigners in the side to bolster their ranks.\n\nThe defending champions, Mumbai Indians, will be coming in with some intense firepower. For RCB, the key element to get into their rhythm will be to pick the right combination.\n\nWith star power in Smriti Mandhana, Georgia Voll, Grace Harris, Nadine de Klerk, Richa Ghosh, Lauren Bell and Linsey Smith leading the charge, they will have to slot the right blend of players in order to get the perfect XI in place. Apart from that, the presence of experience will be crucial for the Royal Challengers as they hope to launch another title.\n\n\nNat Sciver-Brunt could be the key batter in this clash. She was named Player of the Tournament in WPL 2025 after producing a series of dominant performances, scoring freely all around the ground and consistently troubling opposition bowlers. With 1,027 runs in 29 WPL matches so far, Sciver-Brunt remains one of the most reliable and destructive batters in the competition. She will be eager to carry her rich vein of form into the opening game of the new season and set the tone for Mumbai Indians Women.\n\nLeft-arm spinner Radha Yadav could be the key bowler in this clash. After spending the previous three seasons with Delhi Capitals Women, she begins a new chapter with her new team and will be eager to make an immediate impact. Radha has taken 14 wickets in the WPL so far while maintaining an economy rate below eight. Her role in the middle overs will be crucial, as her ability to control the run flow and pick up timely wickets could prove decisive in the contest."
    },
    {
      "id": "joburag-vs-paarl",
      "title": "Joubarg Vs Paarl",
      "url": "https://crickettv.site/home/joburag-vs-paarl/",
      "description": "Durban Super Giants are set to lock horns with Pretoria Capitals in Match 16 of the SA20 2025-26 at Kingsmead in Durban, on Wednesday, January 07."
    },
    {
      "id": "heat-vs-thunder",
      "title": "Sydney Thunder Vs Brisbane Heat",
      "url": "https://crickettv.site/home/heat-vs-thunder/",
      "description": "In the 28th game of the BBL 2025-26, Hobart Hurricanes (HUR) are set to face Adelaide Strikers (STR). The Hobart Hurricanes are performing well in this season so far, as they won five out of the seven games. They also won the previous match against the Sydney Thunder by 6 wickets. Tim Ward performed well for them in the last game and scored 90 runs off 49 balls, while Will Prestwidge took two wickets in the bowling department. "
    },
    {
      "id": "warriors-vs-gaints",
      "title": "Warriors Vs Gaints",
      "url": "https://crickettv.site/home/warriors-vs-gaints/",
      "description": "Gujarat Giants have looked nowhere close to being real contenders for a title in the previous three seasons. However, the revamped unit has made quite a few interesting additions for the 2026 edition. Ashleigh Gardner has been appointed as the full-time skipper of the side, and she will be hoping to prove her worth by leading the side by example.\n\n\n\nUP Warriorz, on the other hand, have welcomed an experienced captain to their set-up in the form of Meg Lanning. She has the habit of taking her side to the finals, and is also a proven leader. She captained Delhi Capitals previously in all three preceding seasons, where they reached the summit clash every time. Hence, she will be hoping to build a similar habit with her new side, especially with someone like Deepti Sharma alongside."
    },
    {
      "id": "india-vs-newzeland",
      "title": "India Vs Newzealand ",
      "url": "https://crickettv.site/home/india-vs-newzeland/",
      "description": "Sanjay Manjrekar recently set off a firestorm with a typically bold and contentious remark about Virat Kohli, claiming that the modern batting legend had chickened out of the Tests and opted for an easier route in international cricket - the ODIs. It needed his brother to counter the widely spread and provocatively controversial statement that has attained viral reach.\n\n\"Seems like people cannot run their houses without taking Virat Kohli's name,\" brother Vikas Kohli said, clearly lashing out at the post without openly mentioning it. That fraternal rebuff is a separate matter, and the jury is still out on whether Kohli actually walked away from Test cricket or was nudged out of the side. His ODI connection, however, is very much relevant in the present context, with an ODI series against New Zealand beginning in 24 hours.\n\nManjrekar's assertion that ODI cricket is the easiest of the three formats appears to have divided opinion, leaving analysts split - especially as it comes in the context of the three-match series beginning in Baroda on Sunday (January 11). Shubman Gill weighed in on the debate, reminding one and all that if the format were truly so easy, India would not have gone without a World Cup title since 2011.\n\n\"I don't think any format is easy. If you look at it, the Indian cricket team hasn't won a World Cup since 2011, so if it was that, he would be winning (the) World Cup every second year. It's easy to say, but I don't think any format is easy, it requires a lot of resilience and a lot of persistence and a lot of determination to be able to win big ICC tournaments,\" the India skipper noted.\n\nThe reason the ODI format is often viewed as the easiest is that for a top-three batter - which Kohli certainly is - it can appear relatively comfortable. The opposition would not strive for a wicket, largely content on containment. Four or five runs an over come like a breeze and the risk levels are comparatively low - arguably the lowest among the three formats.\n\nAdding to the uncomplicated situation are favourable pitches, small boundaries, minimal swing, absence of reverse swing, defensive field positions, fielding restrictions of five inside the circle, good pitches, small boundaries and none too difficult bowlers, particularly in the middle overs, aided by sufficient rest before the matches.\n\nAn average player would need to play roughly 60 balls to get to 50 without taking risks and Kohli is no average player. With five fielders inside the circle, a boundary or a six is available for every shot played over the infield. About 80-90 balls in the middle... and an individual century would be there for the taking.\n"
    }
  ]
}